my_music_app/app/controllers/application_controller.rb

  def current_user
    #basically once you are redirected after logging in successfully,
    #redirected so , you need to find your user again
    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "BvBKbut3-5i2kKb0WEVEMw"], ["LIMIT", 1]]