my_music_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def show
    #params pulling route path (url)
    @user = User.find_by(id: params[:id])
    if @user
      render :show
    else
      flash.now[:errors] << "Invalid user"