my_music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mccree@gmail.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    #you already passed in the username value, so you only need to look
    #up by the username
    #return a user
    user = User.find_by(email: email)